# 4. Пользователь вводит строку из нескольких слов, разделённых пробелами. Вывести каждое слово с новой строки.
# Строки необходимо пронумеровать. Если слово длинное, выводить только первые 10 букв в слове.

str = input("write str: ")
mystr = str.split(' ')
for i in mystr:
    if len(i) > 10:
        print(i[0:10])
    else:
        print(i)


