# 2. Представлен список чисел. Необходимо вывести элементы исходного списка, значения которых больше предыдущего элемента.
# Подсказка: элементы, удовлетворяющие условию, оформить в виде списка. Для формирования списка использовать генератор.
# Пример исходного списка: [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55].
# Результат: [12, 44, 4, 10, 78, 123].

from HW.hw04.my_func import my_enumerate

list_task = [300, 2, 12, 44, 1, 1, 4, 10, 7, 1, 78, 123, 55]
my_list = [el for num, el in my_enumerate(list_task[1:], 1) if el > list_task[num - 1]]
print(my_list)


# 'inf' -- бесконечность
# assert -- поднимает ошибку если указано ошибочное
# @log -- ?
# __name__ системная переменная