# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count,\
    cycle

def startstop (start, stop):
    for el in count(start):
        if el > stop:
            break
        else:
            yield el



"""генератор целый чисел"""
try:
    start = int(input("старт: "))
    stop = int(input("стоп: "))
    my_list = startstop(start, stop)
    print([i for i in my_list])
except ValueError:
    print("Введены некоректные данные")



"""итератор, повторяющий элементы некоторого списка, определенного заранее"""
my_list = [3,4,77]
c = 0
for el in cycle(my_list):
    if c > 10:
        break
    else:
        print(el)
        c+=1





