# 7. Реализовать проект «Операции с комплексными числами». Создайте класс «Комплексное число», реализуйте перегрузку методов сложения и умножения комплексных чисел.
# Проверьте работу проекта, создав экземпляры класса (комплексные числа) и выполнив сложение и умножение созданных экземпляров. Проверьте корректность полученного результата.

class Comp:
    def __init__(self, a, b):
        self.a = a
        self.b = b

    def __add__(self, other):
        return f'n = {self.a + other.a} + {self.b + other.b}i'

    def __mul__(self, other):
        return f'n = {self.a * other.a - (self.b * other.b)} + {self.b * other.a}i'

a = Comp(1, -2)
b = Comp(3, 4)

print(f'Сложение {a + b}')
print(f'Умножение {a * b}')
