# 1. Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса (метод __init__()),
# который должен принимать данные (список списков) для формирования матрицы.
# Подсказка: матрица — система некоторых математических величин, расположенных в виде прямоугольной схемы.
# Примеры матриц вы найдете в методичке.
# Следующий шаг — реализовать перегрузку метода __str__() для вывода матрицы в привычном виде.
# Далее реализовать перегрузку метода __add__() для реализации операции сложения двух объектов класса Matrix (двух матриц).
# Результатом сложения должна быть новая матрица.
# Подсказка: сложение элементов матриц выполнять поэлементно — первый элемент первой строки первой матрицы
# складываем с первым элементом первой строки второй матрицы и т.д.

class Matrix:
    def __init__(self, m_list):
        self.m_list = m_list

    def __str__(self):
        for el in self.m_list:
            print(el)
        print('\n')

    def __add__(self, other):
        result = self.m_list
        try:
            if len(self.m_list) == len(other.m_list) and len(self.m_list[0]) == len(other.m_list[0]):
                for i in range(len(self.m_list)):
                    for j in range(len(self.m_list[0])):
                        result[i][j] += other.m_list[i][j]
                for r in result:
                    print(r)
            else:
                print("Матрицы не одинакового размера")
        except ValueError:
            print('Матрица не из чисел')

matrix_1 = Matrix([[31, 22],[37, 43],[51, 86]])
matrix_2 = Matrix([[31, 22],[37, 43],[51, 86]])

matrix_1.__str__()
matrix_3 = matrix_1 + matrix_2
