# 1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет)
# и метод running (запуск). Атрибут реализовать как приватный.
# В рамках метода реализовать переключение светофора в режимы: красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд,
# второго (желтый) — 2 секунды, третьего (зеленый) — на ваше усмотрение.
# Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.

import time

class TrafficLight:
    __color = {7:"RED", 2:"YELLOW", 5:"GREEN"}

    def running(self):
        """Метод запускающий светофор,
        выводящий в командную
        красный - 7сек
        желтый  - 2сек
        зеленый - 7сек
        """

        for key, value in TrafficLight.__color.items():
            print(value)
            time.sleep(key)

my_traff_col = TrafficLight()
my_traff_col.running()







