# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами.
# Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла.

def my_func(number, degree):
    return number ** degree

while True:
    my_quit = input("Для выхода введите q, для продолжения нажмите Enter: ")
    if my_quit == "q":
        break
    elif not my_quit == "":
        print("Можно просто нажать Enter")
    try:
        number = float(input("Введите действительное положительное число x: "))
        degree = int(input("Введите целое отрицательное число y: "))
        if degree > 0:
            raise ValueError
        print(my_func(number, degree))
    except ValueError:
        print("Введены не корректные данные")



