# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел. Пользователь может продолжить ввод чисел,
# разделенных пробелом и снова нажать Enter. Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел
# к полученной ранее сумме и после этого завершить программу.

summ = 0
flag = True
while flag:
    try:
        str = input("Введите строку чисел, разделенных пробелом\nдля выхода 'q': ")
        massiv_word = str.split()
        massiv_num = []
        for number in massiv_word:
            if number.isdecimal():
                massiv_num.append(float(number))
                summ += float(number)
            elif number == "q":
                print("Дошли до 'q'")
                flag = False
                break
            else:
                print("Введено неккоректное значение")
                break
        print(summ)
    except ValueError:
        print("Введеное не число")
