# чистый python, понимание как работают типы данные
#неизменяемые
var_int = 1
var_str = "str"
var_float = 1.2
# если не asci кодировка используется больше ресурсов
a = "hello"
b= "hello"
a is b #даст True, сравнивает два текса или даже цифры

#изменяемые, коллекции
var_list = [1,2,"grgrt", 34, "world"]   #список изменяемый

user = {'name': '', 'surname': ''}  #словарь изменяемый
user['name'] = input('name')    #обращение по ключу

# for a in b:

a, b = [1, 2]   #a = 1, b = 2
var_set = {1,2,3,4,4,5,6,6} #множество изеняемо

var_f = frozenset({1,2,3,4,4,5,6,6}) #множество не изеняемо
var_tuple = (1,2,3,4)   #кортеж, не изменяемый


